* Github
* Groupby
* pivot_table
Shift+Tb for tip hints

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
url = 'https://raw.githubusercontent.com/RonAlfi/DS2022C/main/CSVFiles/titanic_short.csv'
df = pd.read_csv(url)
df.head()

  pclass  survived      age     sex
0    1st         1  29.0000  female
1    1st         0   2.0000  female
2    1st         0  30.0000    male
3    1st         0  25.0000  female
4    1st         1   0.9167    male

# Github:
## tutorials:
### Watch the Hebrew 2 Github tutorials untill class 7
### Hebrew: https://www.youtube.com/watch?v=oZWUOv6uoo4&list=PLEtZq1oDporg47CTGbru8sJ4afgx8gaBj&index=2
### English: https://www.youtube.com/watch?v=RGOj5yH7evk
* Sign Up to Github (volunteer)
* Create new repository (i.e. project). add readme
* Create new folder (add file abbuse)
* Upload a file (some csv, preclass download csv)
* Get url by clicking file->raw
* Read file by url in python and display

In [3]:
## Uncomment and paste Github file raw url
# url = # paste Github url
# myData = pd.read_csv(url)
# myData.tail()

 # an existing titanic practice data set

In [4]:
titanic = sns.load_dataset('titanic')
titanic.tail() # note survived is 0 or 1

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

* groupby sex and the mean of survival rate:

In [5]:
titanic.groupby('sex')[['survived']].mean() # note double [[ due to series

        survived
sex
female  0.742038
male    0.188908

### we could also groupby sex and class:

In [24]:
gbTitanic = titanic
gbTitanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack()
# seems complicated?

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [7]:
# pivot table come to the rescue.
# what is a pivot table: https://en.wikipedia.org/wiki/Pivot_table
# a pivot table summerize data
# default value of PT is mean
ptTitatnic = titanic
ptTitatnic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

* note mean was the default value for calculation,
* how would we apply different criteria?
* aggfunc parameter comes to the rescue

In [17]:
titanic.pivot_table('survived', index='sex', columns='class', aggfunc='sum')

class   First  Second  Third
sex
female     91      70     72
male       45      17     47

## we can add a third age dimension, for example cut on age of 18:
* Why the aggregated amount is not as without age cut

In [9]:
age = pd.cut(titanic['age'], [0, 18, 100]) 
titanic.pivot_table('survived', ['sex', age], 'class', aggfunc={'survived':sum}) # survived us 0 or 1, therefore sum is amount of survivors

class             First  Second  Third
sex    age
female (0, 18]       10      14     22
       (18, 100]     72      54     25
male   (0, 18]        4       9     11
       (18, 100]     36       6     27

* The reason is sum not as the total is  NaN age values

In [10]:

age = pd.cut(titanic['age'], [0, 18, 80],include_lowest=True) #include_lowest=True include 0 edge
titanic.pivot_table('survived', ['sex', age], 'class')

class                     First    Second     Third
sex    age
female (-0.001, 18.0]  0.909091  1.000000  0.511628
       (18.0, 80.0]    0.972973  0.900000  0.423729
male   (-0.001, 18.0]  0.800000  0.600000  0.215686
       (18.0, 80.0]    0.375000  0.071429  0.133663

* note we displayed the mean, alothough we did not specify it (default).
* we can specify other aggregartion functions, for example sum:
* math signs: ( not include, ] include

## We can count amount of records (regardless to survival)
* len is the total count of passangers in category

In [11]:
age = pd.cut(titanic['age'], [0, 18, 80])
titanic.pivot_table('survived', ['sex', age], 'class', aggfunc={'survived':len})

class            First  Second  Third
sex    age
female (0, 18]      11      14     43
       (18, 80]     74      60     59
male   (0, 18]       5      15     51
       (18, 80]     96      84    202

* display both amount of survivors and records:

In [12]:
age = pd.cut(titanic['age'], [0, 18, 80])
titanic.pivot_table('survived', ['sex', age], 'class', aggfunc=[sum , len])

                  sum                len
class           First Second Third First Second Third
sex    age
female (0, 18]     10     14    22    11     14    43
       (18, 80]    72     54    25    74     60    59
male   (0, 18]      4      9    11     5     15    51
       (18, 80]    36      6    27    96     84   202

## We can use the margins keyword to get the total amount of stats:

In [13]:

titanic.pivot_table('survived',index='sex', columns='class',margins=True , aggfunc='sum')

class   First  Second  Third  All
sex
female     91      70     72  233
male       45      17     47  109
All       136      87    119  342

* Note 72+10 < 91 female, first class for example, this is due to Nan

### Take first half of data

In [14]:
titanic.pivot_table('survived', index='sex', columns='class', aggfunc='sum')

class   First  Second  Third
sex
female     91      70     72
male       45      17     47

In [15]:
copyTitanic = titanic
length = copyTitanic.shape[0]
copyTitanic = copyTitanic[:length//2] 
copyTitanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
440,1,2,female,45.0,1,1,26.2500,S,Second,woman,False,NaN,Southampton,yes,False
441,0,3,male,20.0,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
442,0,3,male,25.0,1,0,7.7750,S,Third,man,True,NaN,Southampton,no,False
443,1,2,female,28.0,0,0,13.0000,S,Second,woman,False,NaN,Southampton,yes,True
444,1,3,male,NaN,0,0,8.1125,S,Third,man,True,NaN,Southampton,yes,True

# self learning:
### 1. learn about github: https://guides.github.com/activities/hello-world/
### video tutorial: https://www.youtube.com/watch?v=dS1mZP54p3I
### 2. excercises with solution: https://www.w3resource.com/python-exercises/pandas/excel/index-pivot.php
### (note first 13 are by excel sheet and csv examples comes after)